results/wrk2/plaintextpost.txt
02:12:47 {master} ~/Projects/com/github/plokhotnyuk/play$ wrk -c50 -d2m -t2 -R15000 -L -v -s src/test/lua/plaintextPost.lua http://localhost:9000/plaintext
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 2m test @ http://localhost:9000/plaintext
  2 threads and 50 connections
  Thread calibration: mean lat.: 3.994ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 3.764ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.76ms    1.93ms  35.36ms   89.48%
    Req/Sec     7.87k     0.97k   11.60k    72.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.28ms
 75.000%    3.18ms
 90.000%    4.51ms
 99.000%   10.92ms
 99.900%   19.68ms
 99.990%   27.23ms
 99.999%   32.59ms
100.000%   35.39ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.193     0.000000            1         1.00
       1.297     0.100000       165043         1.11
       1.587     0.200000       330220         1.25
       1.804     0.300000       495093         1.43
       2.021     0.400000       659427         1.67
       2.275     0.500000       824921         2.00
       2.417     0.550000       906786         2.22
       2.569     0.600000       989658         2.50
       2.741     0.650000      1071594         2.86
       2.937     0.700000      1153866         3.33
       3.177     0.750000      1236142         4.00
       3.317     0.775000      1277861         4.44
       3.471     0.800000      1318998         5.00
       3.649     0.825000      1359909         5.71
       3.859     0.850000      1400969         6.67
       4.131     0.875000      1442476         8.00
       4.307     0.887500      1462975         8.89
       4.515     0.900000      1483486        10.00
       4.771     0.912500      1504259        11.43
       5.087     0.925000      1524697        13.33
       5.507     0.937500      1545335        16.00
       5.767     0.943750      1555610        17.78
       6.059     0.950000      1565828        20.00
       6.411     0.956250      1576128        22.86
       6.831     0.962500      1586420        26.67
       7.351     0.968750      1596734        32.00
       7.659     0.971875      1601845        35.56
       8.019     0.975000      1606995        40.00
       8.439     0.978125      1612154        45.71
       8.935     0.981250      1617298        53.33
       9.519     0.984375      1622475        64.00
       9.863     0.985938      1625023        71.11
      10.231     0.987500      1627583        80.00
      10.647     0.989062      1630177        91.43
      11.111     0.990625      1632733       106.67
      11.671     0.992188      1635329       128.00
      11.991     0.992969      1636612       142.22
      12.359     0.993750      1637888       160.00
      12.767     0.994531      1639170       182.86
      13.271     0.995313      1640469       213.33
      13.887     0.996094      1641747       256.00
      14.263     0.996484      1642398       284.44
      14.703     0.996875      1643035       320.00
      15.263     0.997266      1643675       365.71
      15.927     0.997656      1644325       426.67
      16.703     0.998047      1644961       512.00
      17.151     0.998242      1645288       568.89
      17.663     0.998437      1645606       640.00
      18.287     0.998633      1645929       731.43
      18.959     0.998828      1646251       853.33
      19.775     0.999023      1646573      1024.00
      20.239     0.999121      1646734      1137.78
      20.815     0.999219      1646900      1280.00
      21.311     0.999316      1647054      1462.86
      21.903     0.999414      1647220      1706.67
      22.463     0.999512      1647381      2048.00
      22.735     0.999561      1647456      2275.56
      23.119     0.999609      1647537      2560.00
      23.551     0.999658      1647619      2925.71
      24.015     0.999707      1647698      3413.33
      24.671     0.999756      1647780      4096.00
      25.007     0.999780      1647818      4551.11
      25.359     0.999805      1647860      5120.00
      25.791     0.999829      1647899      5851.43
      26.303     0.999854      1647939      6826.67
      26.767     0.999878      1647980      8192.00
      27.023     0.999890      1647999      9102.22
      27.327     0.999902      1648021     10240.00
      27.599     0.999915      1648040     11702.86
      27.999     0.999927      1648061     13653.33
      28.351     0.999939      1648080     16384.00
      28.591     0.999945      1648090     18204.44
      28.815     0.999951      1648103     20480.00
      29.087     0.999957      1648110     23405.71
      29.695     0.999963      1648120     27306.67
      30.191     0.999969      1648130     32768.00
      30.431     0.999973      1648135     36408.89
      30.655     0.999976      1648140     40960.00
      31.135     0.999979      1648145     46811.43
      31.359     0.999982      1648150     54613.33
      31.791     0.999985      1648155     65536.00
      31.919     0.999986      1648158     72817.78
      32.383     0.999988      1648160     81920.00
      32.591     0.999989      1648164     93622.86
      32.799     0.999991      1648165    109226.67
      32.959     0.999992      1648169    131072.00
      32.959     0.999993      1648169    145635.56
      32.991     0.999994      1648170    163840.00
      33.247     0.999995      1648172    187245.71
      33.375     0.999995      1648173    218453.33
      33.407     0.999996      1648174    262144.00
      33.727     0.999997      1648175    291271.11
      33.727     0.999997      1648175    327680.00
      33.759     0.999997      1648176    374491.43
      34.047     0.999998      1648177    436906.67
      34.047     0.999998      1648177    524288.00
      34.111     0.999998      1648178    582542.22
      34.111     0.999998      1648178    655360.00
      34.111     0.999999      1648178    748982.86
      34.271     0.999999      1648179    873813.33
      34.271     0.999999      1648179   1048576.00
      34.271     0.999999      1648179   1165084.44
      34.271     0.999999      1648179   1310720.00
      34.271     0.999999      1648179   1497965.71
      35.391     0.999999      1648180   1747626.67
      35.391     1.000000      1648180          inf
#[Mean    =        2.763, StdDeviation   =        1.930]
#[Max     =       35.360, Total count    =      1648180]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1799080 requests in 2.00m, 223.05MB read
Requests/sec:  14992.33
Transfer/sec:      1.86MB