results/wrk2/plaintextpost.txt
11:34:15 {play-2.6-with-akka-http} ~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t2 -R7000 -L -v -s src/test/lua/plaintextPost.lua http://localhost:9000/plaintext
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/plaintext
  2 threads and 50 connections
  Thread calibration: mean lat.: 2.130ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.125ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.11ms    1.57ms  27.71ms   94.71%
    Req/Sec     3.69k   496.33     6.78k    81.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.85ms
 75.000%    2.42ms
 90.000%    3.05ms
 99.000%   10.57ms
 99.900%   16.98ms
 99.990%   20.54ms
 99.999%   25.82ms
100.000%   27.73ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.295     0.000000            1         1.00
       1.019     0.100000        34983         1.11
       1.262     0.200000        69871         1.25
       1.468     0.300000       104774         1.43
       1.658     0.400000       139819         1.67
       1.847     0.500000       174745         2.00
       1.946     0.550000       192071         2.22
       2.051     0.600000       209591         2.50
       2.163     0.650000       227209         2.86
       2.281     0.700000       244386         3.33
       2.417     0.750000       261935         4.00
       2.493     0.775000       270674         4.44
       2.577     0.800000       279401         5.00
       2.667     0.825000       288099         5.71
       2.769     0.850000       296788         6.67
       2.893     0.875000       305510         8.00
       2.965     0.887500       309917         8.89
       3.049     0.900000       314281        10.00
       3.141     0.912500       318640        11.43
       3.249     0.925000       322950        13.33
       3.385     0.937500       327335        16.00
       3.471     0.943750       329510        17.78
       3.575     0.950000       331679        20.00
       3.715     0.956250       333848        22.86
       3.909     0.962500       336033        26.67
       4.247     0.968750       338216        32.00
       4.555     0.971875       339303        35.56
       5.099     0.975000       340404        40.00
       5.843     0.978125       341486        45.71
       6.763     0.981250       342576        53.33
       7.991     0.984375       343668        64.00
       8.671     0.985938       344215        71.11
       9.399     0.987500       344767        80.00
      10.103     0.989062       345308        91.43
      10.855     0.990625       345858       106.67
      11.671     0.992188       346401       128.00
      12.063     0.992969       346668       142.22
      12.479     0.993750       346940       160.00
      12.959     0.994531       347218       182.86
      13.455     0.995313       347490       213.33
      13.935     0.996094       347768       256.00
      14.239     0.996484       347897       284.44
      14.535     0.996875       348036       320.00
      14.847     0.997266       348170       365.71
      15.191     0.997656       348305       426.67
      15.591     0.998047       348441       512.00
      15.887     0.998242       348509       568.89
      16.111     0.998437       348579       640.00
      16.415     0.998633       348645       731.43
      16.703     0.998828       348713       853.33
      17.023     0.999023       348782      1024.00
      17.263     0.999121       348817      1137.78
      17.407     0.999219       348850      1280.00
      17.615     0.999316       348885      1462.86
      17.855     0.999414       348918      1706.67
      18.207     0.999512       348953      2048.00
      18.415     0.999561       348969      2275.56
      18.639     0.999609       348986      2560.00
      18.831     0.999658       349003      2925.71
      19.039     0.999707       349020      3413.33
      19.295     0.999756       349037      4096.00
      19.503     0.999780       349046      4551.11
      19.711     0.999805       349054      5120.00
      19.887     0.999829       349063      5851.43
      20.031     0.999854       349072      6826.67
      20.223     0.999878       349080      8192.00
      20.383     0.999890       349084      9102.22
      20.591     0.999902       349088     10240.00
      20.783     0.999915       349093     11702.86
      21.567     0.999927       349097     13653.33
      22.191     0.999939       349101     16384.00
      22.415     0.999945       349103     18204.44
      22.463     0.999951       349105     20480.00
      23.359     0.999957       349108     23405.71
      23.775     0.999963       349110     27306.67
      24.495     0.999969       349112     32768.00
      24.735     0.999973       349113     36408.89
      25.087     0.999976       349114     40960.00
      25.455     0.999979       349115     46811.43
      25.519     0.999982       349116     54613.33
      25.711     0.999985       349117     65536.00
      25.759     0.999986       349118     72817.78
      25.759     0.999988       349118     81920.00
      25.823     0.999989       349119     93622.86
      25.823     0.999991       349119    109226.67
      26.815     0.999992       349120    131072.00
      26.815     0.999993       349120    145635.56
      26.815     0.999994       349120    163840.00
      27.711     0.999995       349121    187245.71
      27.711     0.999995       349121    218453.33
      27.711     0.999996       349121    262144.00
      27.711     0.999997       349121    291271.11
      27.711     0.999997       349121    327680.00
      27.727     0.999997       349122    374491.43
      27.727     1.000000       349122          inf
#[Mean    =        2.108, StdDeviation   =        1.567]
#[Max     =       27.712, Total count    =       349122]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  419592 requests in 1.00m, 52.02MB read
Requests/sec:   6993.09
Transfer/sec:      0.87MB
11:35:32 {play-2.6-with-akka